src/soapXml.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope" xmlns:t="www.example.com">
	<SOAP-ENV:Header> </SOAP-ENV:Header>
	<SOAP-ENV:Body>
		<t:CurrentDate>
			<Zp>ZP</Zp>
			<Name>NAME</Name>
			<Id>ID</Id>
		</t:CurrentDate>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>